app/controllers/test_it_controller.rb

SELECT * FROM `genres` WHERE (`genres`.`id` = 1)
---
  def update_artists
    # updates artists and songs based on genre selected
    genre = Genre.find(params[:genre_id])

SELECT * FROM `artists` WHERE (`artists`.`id` = 1)
---
  def update_songs
    # updates songs based on artist selected
    artist = Artist.find(params[:artist_id])